//反思啊， 反思
//为什么没看出来这道题就是背包的变种
//亏你他妈还练了那么久的背包
//打击啊 混蛋
//只有一个二等奖
//为什么当时做完了不仔细想想
//为什么！
//傻叉
//光是过了样例怎么行
//明年继续吧
//发誓
//一定要拿300分以上
//一定
//一定
//草泥马比的
//为什么会这样！！！
//草泥马比
//骄傲个什么劲啊
//混蛋
//混蛋
//就tm过了一道最简单的模拟
//你妈的激动什么啊
//只有不断的努力才行
//投机取巧..唉
 
//再次反思
//题哪有那么简单的
//一看就能做出来？
//得先理解题目
//列出关系式
//找出状态转移方程
//你做了吗？
//显然没有
//所以你一分未得
//你那明显有漏洞的程序
//竟然你也没有检查
//到考试结束前20分钟才发现
//这是为什么
//还不是自大！
//还不是因为心态
//自以为自己很厉害吗
//身在弱省就能拿省一等奖吗
//可笑 
#include <iostream>
using namespace std;
int f[41][41][41][41];
int sc[1010];
int p[5];
int n , m;
int main()
{
    cin >> n >> m;
    for (int i = 1; i <= n; i++)
        cin >> sc[i];
    int t;
    for (int i = 1; i <= m; i++)
    {
        cin >> t;
        p[t]++;
    }
    f[0][0][0][0] = sc[1];
    int a, b, c, d;
    for (a = 0; a <= p[1]; a++)
        for (b = 0; b <= p[2]; b++)
            for (c = 0; c <= p[3]; c++)
                for (d = 0; d <= p[4]; d++)
                {
                    if (a > 0)f[a][b][c][d] = max(f[a][b][c][d],f[a-1][b][c][d]+sc[a+2*b+3*c+4*d+1]);
                    if (b > 0)f[a][b][c][d] = max(f[a][b][c][d],f[a][b-1][c][d]+sc[a+2*b+3*c+4*d+1]);
                    if (c > 0)f[a][b][c][d] = max(f[a][b][c][d],f[a][b][c-1][d]+sc[a+2*b+3*c+4*d+1]);
                    if (d > 0)f[a][b][c][d] = max(f[a][b][c][d],f[a][b][c][d-1]+sc[a+2*b+3*c+4*d+1]);
                }
    cout << f[p[1]][p[2]][p[3]][p[4]];
    return 0;
}
/*
【输入输出样例1】
9 5
6 10 14 2 8 8 18 5 17
1 3 1 2 1

【输入输出样例2】
13 8
4 96 10 64 55 13 94 53 5 24 89 8 30
1 1 1 1 1 2 4 1
*/
